In [38]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# loading the dataset:

In [39]:

filepath='data/retail_sales.csv'
df=pd.read_csv(filepath)

In [40]:
# shape and the columns:
print("shape",df.shape)
print('Cloumns :',df.columns.tolist())

shape (5, 8)
Cloumns : ['Order ID', 'Order Date', 'Customer Name', 'Region', 'Product Category', 'Sales', 'Discount', 'Profit']

# quick overview of the data:

In [41]:
# data info:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          5 non-null      int64
 1   Order Date        5 non-null      object
 2   Customer Name     5 non-null      object
 3   Region            5 non-null      object
 4   Product Category  5 non-null      object
 5   Sales             5 non-null      float64
 6   Discount          5 non-null      float64
 7   Profit            5 non-null      float64
dtypes: float64(3), int64(1), object(4)
memory usage: 452.0+ bytes

In [42]:
# few rows:
df.head()

,Order ID,Order Date,Customer Name,Region,Product Category,Sales,Discount,Profit
0,1001,2025-01-10,Alice Smith,East,Furniture,250.75,0.10,50.15
1,1002,2025-01-15,Bob Johnson,West,Technology,550.00,0.20,100.00
2,1003,2025-02-01,Charlie Lee,East,Office Supplies,120.40,0.00,30.10
3,1004,2025-02-05,David Wilson,South,Furniture,300.50,0.15,45.20
4,1005,2025-02-10,Eva Brown,North,Technology,800.20,0.05,120.00

In [43]:
# summary statistics:
df.describe(include='all')

,Order ID,Order Date,Customer Name,Region,Product Category,Sales,Discount,Profit
count,5.000000,5,5,5,5,5.000000,5.000000,5.00000
unique,NaN,5,5,4,3,NaN,NaN,NaN
top,NaN,2025-01-10,Alice Smith,East,Furniture,NaN,NaN,NaN
freq,NaN,1,1,2,2,NaN,NaN,NaN
mean,1003.000000,NaN,NaN,NaN,NaN,404.370000,0.100000,69.09000
std,1.581139,NaN,NaN,NaN,NaN,270.608817,0.079057,38.71993
min,1001.000000,NaN,NaN,NaN,NaN,120.400000,0.000000,30.10000
25%,1002.000000,NaN,NaN,NaN,NaN,250.750000,0.050000,45.20000
50%,1003.000000,NaN,NaN,NaN,NaN,300.500000,0.100000,50.15000
75%,1004.000000,NaN,NaN,NaN,NaN,550.000000,0.150000,100.00000
max,1005.000000,NaN,NaN,NaN,NaN,800.200000,0.200000,120.00000

# making cleaned version of csv

In [44]:
# check for missing values
df.isnull().sum()

Order ID            0
Order Date          0
Customer Name       0
Region              0
Product Category    0
Sales               0
Discount            0
Profit              0
dtype: int64

In [45]:
'No missing values'

'No missing values'

In [46]:
# remove duplicates
df.duplicated().sum()

np.int64(0)

In [47]:
'No duplicated values here'

'No duplicated values here'

In [48]:
# standardize columns

# Convert 'Order Date' to datetime
df['Order Date']=pd.to_datetime(df['Order Date'])

# stripping and standardizing the column strings
df['Customer Name']=df['Customer Name'].str.strip().str.title()
df['Region']=df['Region'].str.strip().str.title()
df['Product Category']=df['Product Category'].str.strip().str.title()

# droping the duplicated values if exists:
df=df.drop_duplicates()

In [49]:
# converting the dataset to csv file:

df.to_csv('cleaned.csv',index=False)

# Univariate Analysis

In [50]:
df.head()

,Order ID,Order Date,Customer Name,Region,Product Category,Sales,Discount,Profit
0,1001,2025-01-10,Alice Smith,East,Furniture,250.75,0.10,50.15
1,1002,2025-01-15,Bob Johnson,West,Technology,550.00,0.20,100.00
2,1003,2025-02-01,Charlie Lee,East,Office Supplies,120.40,0.00,30.10
3,1004,2025-02-05,David Wilson,South,Furniture,300.50,0.15,45.20
4,1005,2025-02-10,Eva Brown,North,Technology,800.20,0.05,120.00

In [51]:
# number of regions counts:

# preparing the data:
value_counts=df['Region'].value_counts().reset_index()
value_counts.columns=['Regions','count']
value_counts=value_counts.sort_values(by='count')

plt.figure(figsize=(12,7))
barplot=sns.countplot(data=value_counts,x='Regions',y='count',palette='viridis')

for i,row in value_count.iterrow():
    barplot.text(i,row['count']+0.5,row['count'],color='black',ha='center',fontsize=9)

<function matplotlib.pyplot.figure(num: 'int | str | Figure | SubFigure | None' = None, figsize: 'tuple[float, float] | None' = None, dpi: 'float | None' = None, *, facecolor: 'ColorType | None' = None, edgecolor: 'ColorType | None' = None, frameon: 'bool' = True, FigureClass: 'type[Figure]' = <class 'matplotlib.figure.Figure'>, clear: 'bool' = False, **kwargs) -> 'Figure'>